
&НаСервереБезКонтекста
Процедура Команда1НаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПоставщика.Ссылка КАК Ссылка,
		|	СчетНаОплатуПоставщика.ПаспортНаПеревозку КАК ПаспортНаПеревозку
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	СчетНаОплатуПоставщика.ПаспортНаПеревозку <> ЗНАЧЕНИЕ(ДОкумент.ЗаявкаНаПеревозку.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СчетОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаТовары Из СчетОбъект.Товары Цикл
			Если Не ЗначениеЗаполнено(СтрокаТовары.ПаспортНаПеревозкуПоСтроке) Тогда
				СтрокаТовары.ПаспортНаПеревозкуПоСтроке = ВыборкаДетальныеЗаписи.ПаспортНаПеревозку;	
			КонецЕсли;
		КонецЦикла;
		СчетОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
