
&НаСервере
Процедура СформироватьНаСервере()
	ЭтотОтчет = РеквизитФормыВЗначение("Объект");
    Макет = ЭтотОтчет.ПолучитьМакет("Макет11"); 	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//Макет = ВнешниеОбработки.ПечатьСчетовЛС.ПолучитьМакет("Макет11");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Номер КАК Номер,
		|	СчетНаОплатуПокупателю.Дата КАК Дата,
		|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(СчетНаОплатуПокупателю.Контрагент) КАК КонтрагентПредставление,
		|	СчетНаОплатуПокупателю.Комментарий КАК Комментарий,
		|	СчетНаОплатуПокупателю.ТД КАК ТД,
		|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(СчетНаОплатуПокупателюТовары.Номенклатура) КАК НоменклатураПредставление,
		|	СчетНаОплатуПокупателюТовары.Содержание КАК Содержание,
		|	СчетНаОплатуПокупателюТовары.Сумма КАК Сумма,
		|	СчетНаОплатуПокупателюТовары.СтавкаНДС КАК СтавкаНДС,
		|	СчетНаОплатуПокупателюТовары.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
		|		ПО (СчетНаОплатуПокупателюТовары.Ссылка = СчетНаОплатуПокупателю.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыLogiSmart КАК ОбъектыLogiSmart
		|		ПО (ОбъектыLogiSmart.Объект = СчетНаОплатуПокупателю.Ссылка)
		|ГДЕ
		|	ОбъектыLogiSmart.Объект ЕСТЬ NULL
		|	И СчетНаОплатуПокупателю.Дата > &НачДата
		|	И СчетНаОплатуПокупателю.ПодразделениеОрганизации = &ПодразделениеОрганизации
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(СуммаНДС)
		|ПО
		|	Номер,
		|	Дата,
		|	Контрагент,
		|	КонтрагентПредставление";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьНомер = Макет.ПолучитьОбласть("Номер");
	ОбластьДата = Макет.ПолучитьОбласть("Дата");
	ОбластьКонтрагент = Макет.ПолучитьОбласть("Контрагент");
	ОбластьКонтрагентПредставление = Макет.ПолучитьОбласть("КонтрагентПредставление");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНомер.Следующий() Цикл
		ОбластьНомер.Параметры.Заполнить(ВыборкаНомер);
		ТабДок.Вывести(ОбластьНомер, ВыборкаНомер.Уровень());
	
		ВыборкаДата = ВыборкаНомер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаДата.Следующий() Цикл
			ОбластьДата.Параметры.Заполнить(ВыборкаДата);
			ТабДок.Вывести(ОбластьДата, ВыборкаДата.Уровень());
	
			ВыборкаКонтрагент = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаКонтрагент.Следующий() Цикл
				ОбластьКонтрагент.Параметры.Заполнить(ВыборкаКонтрагент);
				ТабДок.Вывести(ОбластьКонтрагент, ВыборкаКонтрагент.Уровень());
	
				ВыборкаКонтрагентПредставление = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
				Пока ВыборкаКонтрагентПредставление.Следующий() Цикл
					ОбластьКонтрагентПредставление.Параметры.Заполнить(ВыборкаКонтрагентПредставление);
					ТабДок.Вывести(ОбластьКонтрагентПредставление, ВыборкаКонтрагентПредставление.Уровень());
	
					ВыборкаДетальныеЗаписи = ВыборкаКонтрагентПредставление.Выбрать();
	
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
						ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА



КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
	
	


