
&НаСервере
Процедура СформироватьНаСервере()
	ЭтотОтчет = РеквизитФормыВЗначение("Объект");
    Макет = ЭтотОтчет.ПолучитьМакет("Макет");
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//Макет = ВнешниеОбработки.ВходящиеСчетаLS.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Номер КАК Номер,
		|	ПоступлениеТоваровУслуг.Дата КАК Дата,
		|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Контрагент) КАК КонтрагентПредставление,
		|	ПоступлениеТоваровУслуг.Комментарий КАК Комментарий,
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУслуги.Номенклатура) КАК НоменклатураПредставление,
		|	ПоступлениеТоваровУслугУслуги.Содержание КАК Содержание,
		|	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|		ПО (ПоступлениеТоваровУслугУслуги.Ссылка = ПоступлениеТоваровУслуг.Ссылка)
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Дата > &НачДата
		|	И ПоступлениеТоваровУслуг.ПодразделениеОрганизации = &ПодразделениеОрганизации
		|	И ПоступлениеТоваровУслуг.СчетНаОплатуПоставщика = &СчетНаОплатуПоставщика
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(СуммаНДС)
		|ПО
		|	Номер,
		|	Дата,
		|	Контрагент";
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("СчетНаОплатуПоставщика", СчетНаОплатуПоставщика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьНомер = Макет.ПолучитьОбласть("Номер");
	ОбластьДата = Макет.ПолучитьОбласть("Дата");
	ОбластьКонтрагент = Макет.ПолучитьОбласть("Контрагент");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНомер.Следующий() Цикл
		ОбластьНомер.Параметры.Заполнить(ВыборкаНомер);
		ТабДок.Вывести(ОбластьНомер, ВыборкаНомер.Уровень());
	
		ВыборкаДата = ВыборкаНомер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаДата.Следующий() Цикл
			ОбластьДата.Параметры.Заполнить(ВыборкаДата);
			ТабДок.Вывести(ОбластьДата, ВыборкаДата.Уровень());
	
			ВыборкаКонтрагент = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаКонтрагент.Следующий() Цикл
				ОбластьКонтрагент.Параметры.Заполнить(ВыборкаКонтрагент);
				ТабДок.Вывести(ОбластьКонтрагент, ВыборкаКонтрагент.Уровень());
	
				ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
					ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
	
