
&НаСервере
Процедура Команда1НаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыLogiSmart.Объект КАК Объект,
		|	ОбъектыLogiSmart.Валюта КАК Валюта,
		|	ОбъектыLogiSmart.ID_LS КАК ID_LS,
		|	УслугиЭкспедирования.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ОбъектыLogiSmart КАК ОбъектыLogiSmart
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УслугиЭкспедирования КАК УслугиЭкспедирования
		|		ПО ОбъектыLogiSmart.Объект = УслугиЭкспедирования.Номенклатура
		|			И (УслугиЭкспедирования.Ссылка ЕСТЬ NULL)
		|ГДЕ
		|	ОбъектыLogiSmart.Объект В ИЕРАРХИИ(&Объект)";
	
	Запрос.УстановитьПараметр("Объект", ГруппаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяУслуга = Справочники.УслугиЭкспедирования.СоздатьЭлемент();
		НоваяУслуга.Номенклатура = ВыборкаДетальныеЗаписи.Объект;
		НоваяУслуга.Наименование = ВыборкаДетальныеЗаписи.Объект.Наименование;
		НоваяУслуга.НаименованиеСодержания = ВыборкаДетальныеЗаписи.Объект.Наименование;
		НоваяУслуга.Записать();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
